{
  "backend/main.mo": "Main backend actor providing product CRUD, user and buyer profiles, and authorization checks using access control mixins and role-based permissions.",
  "backend/migration.mo": "Migration module converting old product records to the new format by adding a default category field.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for quick reference.",
  "frontend/index.css": "Global Tailwind-based styles defining the warm kirana-inspired palette and mobile-first defaults.",
  "frontend/index.html": "Main HTML entry point configuring meta tags, manifest, icons, and bootstrapping the app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme colors, icons, and launch configuration.",
  "frontend/public/sw.js": "Service worker implementing network-first caching with offline fallback and cache versioning.",
  "frontend/README-TWA-APK.md": "Documentation explaining how to package the PWA into an Android APK using Trusted Web Activity.",
  "frontend/src/App.tsx": "Root React component rendering the StoreHome page.",
  "frontend/src/components/admin/VendorAccessManager.tsx": "Admin UI for granting or revoking vendor access via principal ID with validation and status alerts.",
  "frontend/src/components/buyer/BuyerLoginStatus.tsx": "Displays buyer login state and provides login/logout actions using Internet Identity.",
  "frontend/src/components/DailyDealsPriceEditor.tsx": "Dialog component allowing vendors to edit daily deal prices with validation and mutation updates.",
  "frontend/src/components/KiranaThemeNotes.md": "Design system notes describing colors, typography, spacing, and component styling for the kirana theme.",
  "frontend/src/components/vendor/VendorDashboardPanel.tsx": "Vendor dashboard showing authorization status and a form to add products with validation and mutations.",
  "frontend/src/components/vendor/VendorLoginStatus.tsx": "Shows vendor login state and handles login/logout via Internet Identity.",
  "frontend/src/constants/productCategories.ts": "Defines product category metadata including labels, icons, and helper lookup functions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useBuyerProfileQueries.ts": "Provides hooks to fetch and save the caller's buyer profile using react-query, with actor and identity-based enabling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, identities, and login flows.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for products, user roles, buyer profiles, and vendor/admin mutations with backend actor calls.",
  "frontend/src/hooks/useVendorAccess.ts": "Evaluates vendor and admin access by querying the caller's role and checking identity state.",
  "frontend/src/hooks/useVendorMode.ts": "Manages vendor-only UI mode via URL/session parameters with helpers to enable or disable it.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light/dark modes with mobile-friendly defaults.",
  "frontend/src/main.tsx": "App entry point setting up React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/StoreHome.tsx": "Main store page showing products, vendor controls, and login status with UI for browsing and vendor actions.",
  "frontend/src/utils/actorErrors.ts": "Normalizes backend and agent errors into user-friendly messages for common authorization and validation cases.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash params, persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, container settings, and plugin usage.",
  "project_state.json": "JSON file describing project state, including category-related features, requirements, and pending requests."
}